{"18046.0": {"id": "18046.0", "parentId": null, "relation": null, "votes": null, "text": ""}, "18046.1": {"id": "18046.1", "parentId": "18046.0", "relation": 0, "votes": null, "text": "Businesses should pay people on a structured and distinct scale rather than allow employees to negotiate salaries."}, "18046.2": {"id": "18046.2", "parentId": "18046.1", "relation": 1, "votes": null, "text": "Paying people the same money for the same job regardless of seniority, experience, education or characteristics \\(ie age, gender etc\\) is more fair.", "score": -1, "volume": -1}, "18046.3": {"id": "18046.3", "parentId": "18046.1", "relation": 1, "votes": null, "text": "Knowing that you are working in a defined salary structure means you know what to expect.", "score": -1, "volume": -1}, "18046.4": {"id": "18046.4", "parentId": "18046.1", "relation": 1, "votes": null, "text": "It is easier for a company to structure outgoings and budget for the future; therefore, it means they are better placed to make fiscal deductions and plan for the future.", "score": -1, "volume": -1}, "18046.5": {"id": "18046.5", "parentId": "18046.1", "relation": 1, "votes": null, "text": "Companies can save money and time in the long run because employee salaries are never prone to fluctuations or negotiations with employees that could go south meaning that people would not have a reason to exit the business on grounds of pay.", "score": -1, "volume": -1}, "18046.6": {"id": "18046.6", "parentId": "18046.1", "relation": 1, "votes": null, "text": "Full transparency over pay can help [build trust](https://www.payscale.com/salary-negotiation-guide/what-is-pay-transparency) in the workplace.", "score": -1, "volume": -1}, "18046.7": {"id": "18046.7", "parentId": "18046.1", "relation": -1, "votes": null, "text": "Fully transparent up front pay can mean that top talent is put off because they may consider the remuneration inadequate.", "score": -1, "volume": -1}, "18046.8": {"id": "18046.8", "parentId": "18046.1", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "Structured pay may mean that top performers [eventually leave](https://www.cio.com/article/2858746/9-reasons-good-employees-leave-and-how-you-can-prevent-it.html) the company for more lucrative roles \\(even ones that are exactly the same as what they do but for a competitor\\).", "score": 4.0, "volume": 1}, "18046.9": {"id": "18046.9", "parentId": "18046.1", "relation": -1, "votes": null, "text": "Paying people based on negotiation at the hiring phase means that a business can “profit” by hiring people who do the same job for slightly less than what they budget for.", "score": -1, "volume": -1}, "18046.10": {"id": "18046.10", "parentId": "18046.1", "relation": -1, "votes": [0, 0, 0, 1, 1], "text": "Paying people the exact same amount of money regardless of seniority may disincentivise more experienced colleagues and lead them to being disgruntled.", "score": 3.5, "volume": 2}, "18046.11": {"id": "18046.11", "parentId": "18046.10", "relation": -1, "votes": [0, 0, 1, 0, 0], "text": "Seniority can be one of the measures of a pay scales."}, "18046.12": {"id": "18046.12", "parentId": "18046.11", "relation": 1, "votes": null, "text": "In [Korea](https://www.kialo.com/no-kind-of-weapons-should-be-allowed-to-be-exported-to-other-countries-17454/permissions?back=https%3A%2F%2Fwww.kialo.com%2Fno-kind-of-weapons-should-be-allowed-to-be-exported-to-other-countries-17454%2F17454.0%3D17454.10%2F%3D17454.10%2Fcomments) the seniority based wage system is prevelant."}, "18046.13": {"id": "18046.13", "parentId": "18046.12", "relation": -1, "votes": null, "text": "[A fewer percentage of companies](https://www.kialo.com/no-kind-of-weapons-should-be-allowed-to-be-exported-to-other-countries-17454/permissions?back=https%3A%2F%2Fwww.kialo.com%2Fno-kind-of-weapons-should-be-allowed-to-be-exported-to-other-countries-17454%2F17454.0%3D17454.10%2F%3D17454.10%2Fcomments) makes use of a seniority wage based system than earlier. This indicates that market forced don't condone this."}, "18046.14": {"id": "18046.14", "parentId": "18046.6", "relation": -1, "votes": null, "text": "Full transparency over pay will only help to build trust if a company is paying the same salaries to everyone who is performing the same job; otherwise such a policy could actually lead to greater distrust and resentment among employees."}, "18046.15": {"id": "18046.15", "parentId": "18046.2", "relation": -1, "votes": null, "text": "It could be argued that such a policy is actually less fair since those who have worked harder and longer are paid the same as those with little experience or who might 'phone it in.'"}, "18046.16": {"id": "18046.16", "parentId": "18046.15", "relation": 1, "votes": null, "text": "It is fairer to offer compensation based on merit than to dole it out equitably to all regardless of a person's work ethic."}, "18046.17": {"id": "18046.17", "parentId": "18046.6", "relation": 1, "votes": null, "text": "Knowing exactly the salary and conditions before accepting the job allows one to immediately know what to expect. Both employer and employee understand clearly the situation and there is no misunderstanding."}, "18046.18": {"id": "18046.18", "parentId": "18046.2", "relation": -1, "votes": null, "text": "Those who have studied more and have more experience deserve to have a salary reflecting their hard work. Without a reward there is no incentive to study or develop one's self."}, "18046.19": {"id": "18046.19", "parentId": "18046.2", "relation": 1, "votes": null, "text": "The same salary should be given to those regardless of sex or age. Such characteristics do not affect one's ability to do the job."}, "18046.20": {"id": "18046.20", "parentId": "18046.3", "relation": -1, "votes": null, "text": "It is never certain that everyone is on the same salary. Even with a \"defined salary structure\", there is never 100% guarantee everyone is being paid the same, there are almost always loopholes."}, "18046.21": {"id": "18046.21", "parentId": "18046.4", "relation": 1, "votes": null, "text": "Having fixed salaries helps [forecasting budgets](https://www.entrepreneur.com/article/76418), it is more convenient for companies to plan, making budgets easier to manage."}, "18046.22": {"id": "18046.22", "parentId": "18046.4", "relation": -1, "votes": null, "text": "Companies generally have a [leeway](https://knowhow.ncvo.org.uk/tools-resources/financial-procedures-manual/writing-the-financial-procedures-manual/exercising-budgetary-control-and-monitoring) for budgets and anticipate changes within the numbers. Therefore fluctuations in salaries is not a shock to the system, but actually part of the system."}, "18046.23": {"id": "18046.23", "parentId": "18046.6", "relation": 1, "votes": null, "text": "So long as both sides are in agreement with the fixed salary, both employer and employees can relax as there is no more discussion or questioning about the salary."}, "18046.24": {"id": "18046.24", "parentId": "18046.23", "relation": 1, "votes": null, "text": "It can be quite stressful for everyone discussing and negotiating salaries; therefore, work relationships are more at ease without such a burden."}, "18046.25": {"id": "18046.25", "parentId": "18046.5", "relation": -1, "votes": null, "text": "If people are unsatisfied with their salary then they will leave. Since the salary is not negotiable they know they will not be able to change it. Either they stay unsatisfied or find a job with a better salary."}, "18046.26": {"id": "18046.26", "parentId": "18046.5", "relation": -1, "votes": null, "text": "Employees who have been doing the same job for a long period may leave if their salary is structured. They might not feel valued if they cannot ask for a pay rise after so many years working for a company."}, "18046.27": {"id": "18046.27", "parentId": "18046.26", "relation": 1, "votes": null, "text": "This perfectly fits the nature and culture of modern practise in the private business world today"}, "18046.28": {"id": "18046.28", "parentId": "18046.26", "relation": -1, "votes": null, "text": "There are organisations where this isn’t possible today. For example government service where an employee isn’t allowed \\(in many territories around the world\\) to ask for a pay rise"}, "18046.29": {"id": "18046.29", "parentId": "18046.8", "relation": -1, "votes": null, "text": "Just because structured pay is not negotiable does not mean that the salary will be low. Companies are well aware of competition therefore will offer their top performers desirable salaries."}, "18046.30": {"id": "18046.30", "parentId": "18046.18", "relation": -1, "votes": null, "text": "However, regardless of experience or knowledge level, if two workers produce the exact same amount of contribution they should surely be paid the exact same amount of money. What degrees or experience they have earned previously should not matter if what they are producing for a business \\(for example, level of sales/production\\) is exactly the same."}, "18046.32": {"id": "18046.32", "parentId": "18046.9", "relation": -1, "votes": null, "text": "This works both ways. There can also be employees who will be paid more than what the company had originally planned for."}, "18046.34": {"id": "18046.34", "parentId": "18046.2", "relation": 1, "votes": null, "text": "With today's current climate sexism is a hot topic in the work place, if men and women are not paid equally for doing the same job it is considered to be sexist."}, "18046.33": {"id": "18046.33", "parentId": "18046.7", "relation": -1, "votes": null, "text": "In order to attract top talent the salary has to be attractive, especially if not negotiable later on. Therefore the company may actually have to propose a fixed salary more than if they had left it up for negotiation in the first place."}, "18046.37": {"id": "18046.37", "parentId": "18046.8", "relation": 1, "votes": null, "text": "Top talent will not stick around if they see no room for upgrading their salary, especially if they see other companies willing to be more open to discussions regarding salaries."}, "18046.38": {"id": "18046.38", "parentId": "18046.9", "relation": 1, "votes": null, "text": "Non-negotiable salaries are an effective way for companies to cap their outgoings. There are always a surplus of people looking for jobs no matter how low the pay is."}, "18046.39": {"id": "18046.39", "parentId": "18046.10", "relation": 1, "votes": null, "text": "Paying the same across the board despite longevity in the workplace is a thankless approach to loyal employees and does nothing to promote an encouraging work environment."}, "18046.31": {"id": "18046.31", "parentId": "18046.39", "relation": 1, "votes": null, "text": "Disregarding seniority is not conducive for creating a highly-functioning team with good work relationships between colleagues, but instead is a breeding ground for resentment amongst the oldest employees."}, "18046.42": {"id": "18046.42", "parentId": "18046.10", "relation": -1, "votes": null, "text": "Not adhering to superiority and treating all equal could bring an increased sense of harmony to the workplace."}, "18046.43": {"id": "18046.43", "parentId": "18046.42", "relation": 1, "votes": null, "text": "By not giving special treatment to employees there is a more balanced personnel with no hierarchy. This is conducive for a friendly and in-sync team as everyone is on the same level and there is no competition."}, "18046.46": {"id": "18046.46", "parentId": "18046.42", "relation": 1, "votes": null, "text": "Often in the workplace age and experience can be used against people in a deprecating, [negative](https://www.peoplemanagement.co.uk/long-reads/articles/age-last-workplace-taboo) way."}, "18046.47": {"id": "18046.47", "parentId": "18046.43", "relation": -1, "votes": null, "text": "A healthy amount of competition is beneficial for the workplace as it keeps employees on their toes and makes them work harder."}, "18046.50": {"id": "18046.50", "parentId": "18046.6", "relation": -1, "votes": null, "text": "Not moving on salaries does not create trust but instead a disconnection between employer and employee since there is no room for discussion on an important foundation of the job."}, "18046.51": {"id": "18046.51", "parentId": "18046.6", "relation": -1, "votes": null, "text": "The process of negotiating a salary is beneficial for building trust and communication. It shows the integrity and assertiveness of the employee for not settling and knowing their value."}, "18046.52": {"id": "18046.52", "parentId": "18046.51", "relation": 1, "votes": null, "text": "[Negotiating](https://work.chron.com/advantages-salary-negotiation-8338.html) is a learning experience that teaches both parties the value of communication and cooperation."}, "18046.53": {"id": "18046.53", "parentId": "18046.24", "relation": 1, "votes": null, "text": "Even after negotiation employees can still wonder if they are being compensated fairly. Therefore it is never a win for those involved, because there is no transparency with the situation."}, "18046.54": {"id": "18046.54", "parentId": "18046.3", "relation": 1, "votes": null, "text": "A defined salary structure offers a sense of stability and comfort as one knows their expectations of their income will be satisfied without any confusion or discussion."}, "18046.55": {"id": "18046.55", "parentId": "18046.3", "relation": 1, "votes": null, "text": "Comparisons amongst people doing the same job are reduced, as a consequence there is less jealousy amongst others, since everyone knows exactly the equal amount others are getting."}, "18046.56": {"id": "18046.56", "parentId": "18046.5", "relation": 1, "votes": null, "text": "Job stability and income security is a big factor for employees staying in their job. If their income is guaranteed this is one less reason to leave a job."}, "18046.57": {"id": "18046.57", "parentId": "18046.5", "relation": 1, "votes": null, "text": "It saves time for companies since they don't have to continuously need to hire and retrain employees which takes up a lot of [time and money](https://hundred5.com/blog/cost-of-hiring-an-employee). Keeping competent and happy staff who know their job very well is optimal for the company."}, "18046.58": {"id": "18046.58", "parentId": "18046.32", "relation": -1, "votes": null, "text": "Some people will naturally be disenfranchised."}, "18046.59": {"id": "18046.59", "parentId": "18046.58", "relation": 1, "votes": null, "text": "This might also depend on discrimination based on owners' beliefs."}, "18046.60": {"id": "18046.60", "parentId": "18046.34", "relation": 1, "votes": null, "text": "This is due to the [pre-existing gender bias](https://www.telegraph.co.uk/women/business/6-myths-equal-pay-comebacks-need-shoot/) in pay between men and women."}, "18046.61": {"id": "18046.61", "parentId": "18046.3", "relation": 1, "votes": null, "text": "It also means you do not have to wonder if others are making more money than you in the workplace."}, "18046.62": {"id": "18046.62", "parentId": "18046.1", "relation": -1, "votes": null, "text": "An employment contract is between an business and an individual. Given that contracts are generally [negotiated](https://www.nolo.com/legal-encyclopedia/contract-negotiation-basics-33337.html), it is unjust to disadvantage an employee by taking away his ability to negotiate terms that he is willing to accept.", "score": -1, "volume": -1}, "18046.63": {"id": "18046.63", "parentId": "18046.17", "relation": -1, "votes": null, "text": "Standardizing a pay scale is no better or worse for accomplishing this than a simple employment contract, and does not take away the individual's right to negotiate on one's behalf."}, "18046.117": {"id": "18046.117", "parentId": "18046.11", "relation": 1, "votes": null, "text": "The US Federal Government and US Military both have seniority as part of their public payscales. You can see in the following links that both 'steps' and 'over x' \\(years\\) are indicators of increases in pay due to time spent in the US federal or military organization. [Federal Government General Schedule](https://www.opm.gov/policy-data-oversight/pay-leave/salaries-wages/2019/general-schedule/) [US Military Payscale](https://militarybenefits.info/2019-military-pay-charts/)"}}