{"10436.0": {"id": "10436.0", "parentId": null, "relation": null, "votes": null, "text": ""}, "10436.1": {"id": "10436.1", "parentId": "10436.0", "relation": 0, "votes": null, "text": "Salaries \\(and other forms of compensation\\) should be public."}, "10436.5": {"id": "10436.5", "parentId": "10436.1", "relation": 1, "votes": null, "text": "Police would be able to tell when people are living beyond their means and thus identify criminal activity.", "score": -1, "volume": -1}, "10436.6": {"id": "10436.6", "parentId": "10436.1", "relation": 1, "votes": null, "text": "Pride in earning above the industry average would make people feel better.", "score": -1, "volume": -1}, "10436.7": {"id": "10436.7", "parentId": "10436.1", "relation": 1, "votes": null, "text": "Earning below the industry average could spur people on to work harder or smarter.", "score": -1, "volume": -1}, "10436.8": {"id": "10436.8", "parentId": "10436.1", "relation": 1, "votes": null, "text": "We'd end up with fewer overpaid brown-nosers.", "score": -1, "volume": -1}, "10436.9": {"id": "10436.9", "parentId": "10436.1", "relation": -1, "votes": null, "text": "There'd be envy.", "score": -1, "volume": -1}, "10436.11": {"id": "10436.11", "parentId": "10436.5", "relation": -1, "votes": null, "text": "They would still need warrants for financial information. Different individuals invest money in vastly different capacities, with different results, and different risk aversion. Simply having an individual's income is not enough grounds for most police activity."}, "10436.13": {"id": "10436.13", "parentId": "10436.1", "relation": 1, "votes": null, "text": "This would reduce and possibly eliminate the gender and other pay gaps.", "score": -1, "volume": -1}, "10436.14": {"id": "10436.14", "parentId": "10436.1", "relation": -1, "votes": null, "text": "This would lead to unnecessary and unofficial hierarchies in the same level based on salaries.", "score": -1, "volume": -1}, "10436.15": {"id": "10436.15", "parentId": "10436.1", "relation": -1, "votes": null, "text": "Employees might feel entitled to a higher pay after learning the salaries of their colleagues. In this process soft skills and competencies would be ignored.", "score": -1, "volume": -1}, "10436.18": {"id": "10436.18", "parentId": "10436.5", "relation": -1, "votes": null, "text": "A big enough segment of the population has extra income based on inheritance, real estate and other rents, which would make this approach less efficient"}, "10436.19": {"id": "10436.19", "parentId": "10436.14", "relation": -1, "votes": null, "text": "It's in human nature to create unofficial and unnecessary hierarchies based on the fastest talking, the tallest, the fittest, the prettiest/handsomest, the friendliest, the wisest. One more way to form such isn't going to amount to much."}, "10436.24": {"id": "10436.24", "parentId": "10436.13", "relation": -1, "votes": null, "text": "A significant part of the gender pay gap is caused by subtle pressure for women to go into lower-paying professions, not bosses choosing to pay their male and female employees differently."}, "10436.25": {"id": "10436.25", "parentId": "10436.1", "relation": -1, "votes": null, "text": "Many employees would view this as an invasion of privacy.", "score": -1, "volume": -1}, "10436.20": {"id": "10436.20", "parentId": "10436.25", "relation": 1, "votes": null, "text": "Most states of the United States grant a right to privacy and recognize four torts based on this right:\nIntrusion upon seclusion or solitude, or into private affairs;\nPublic disclosure of embarrassing private facts;\nPublicity which places a person in a false light in the public eye; and Appropriation of name or likeness."}, "10436.53": {"id": "10436.53", "parentId": "10436.7", "relation": 1, "votes": null, "text": "Human beings are inherently [competitive](https://www.psychologytoday.com/intl/blog/socially-relevant/201506/the-psychology-competition). If they know people in the same industry have higher wages than them, they will make an effort to catch up."}, "10436.55": {"id": "10436.55", "parentId": "10436.13", "relation": -1, "votes": null, "text": "In female-heavy professions, women get [paid more](https://fairygodboss.com/articles/4-careers-where-women-earn-more-than-men) than men. Critics of the feminist movement are likely to use this to discredit the gender pay gap."}, "10436.57": {"id": "10436.57", "parentId": "10436.55", "relation": -1, "votes": null, "text": "In industries where men are in majority, which are in the vast [majority](https://www.fastcompany.com/3053226/what-the-gender-pay-gap-looks-like-by-industry), the gender pay gap will be visible."}, "10436.71": {"id": "10436.71", "parentId": "10436.13", "relation": 1, "votes": null, "text": "Pressure is likely to be placed on employers to equally pay men and women if the massive pay differentials are discovered."}, "10436.73": {"id": "10436.73", "parentId": "10436.71", "relation": 1, "votes": null, "text": "Women are less [confident](https://hbrascend.org/topics/why-women-dont-negotiate-their-job-offers) than men while negotiating their salary. Employers take advantage of this and pay women less. Once there is enough pressure on employers, they are unlikely to strong-arm women into accepting lower salaries during negotiations."}, "10436.75": {"id": "10436.75", "parentId": "10436.7", "relation": -1, "votes": null, "text": "People could be [demotivated](https://www.threethriftyguys.com/2019/04/would-knowing-everyones-salaries-demotivate-you/) as well if they earn lower than the industry average."}, "10436.77": {"id": "10436.77", "parentId": "10436.75", "relation": 1, "votes": null, "text": "Finding out that peers earn on average [10%](https://www.threethriftyguys.com/2019/04/would-knowing-everyones-salaries-demotivate-you/) more than initially thought caused employees to spend 9.4% fewer hours in the office, send 4.3% fewer emails and sell 7.3% less."}, "10436.81": {"id": "10436.81", "parentId": "10436.4", "relation": -1, "votes": null, "text": "Anyone can use websites like [Glassdoor](https://www.glassdoor.com/Salaries/boulder-graphic-designer-salary-SRCH_IL.0,7_IM110_KO8,24.htm) or other sources to find industry average wages. Additionally, anyone can go elsewhere to interview and discover what others are willing to pay them."}, "10436.91": {"id": "10436.91", "parentId": "10436.7", "relation": -1, "votes": null, "text": "People are motivated to earn more because more money makes their lives easier, not just because they are above or below some average."}, "10436.95": {"id": "10436.95", "parentId": "10436.1", "relation": 1, "votes": null, "text": "By knowing the salaries of your peers, you have more power as an individual in a possible discussion about your salary. This would avoid gaps between people that have exactly the same work, but are paid less due to unfair reasons. It balances the power in the boss-employee relationship.", "score": -1, "volume": -1}, "10436.97": {"id": "10436.97", "parentId": "10436.8", "relation": 1, "votes": null, "text": "Employers could hesitate to raise the salary of people who don't do a significantly better job than their peers without a good reason if they know it's going to look like favoritism."}, "10436.4": {"id": "10436.4", "parentId": "10436.95", "relation": 1, "votes": null, "text": "Currently your boss could be lying to you about paying you above the industry average and you may never know."}, "10436.100": {"id": "10436.100", "parentId": "10436.8", "relation": -1, "votes": null, "text": "Because favoritism is intrinsic to human nature making salaries public is not going to be a complete solution."}, "10436.102": {"id": "10436.102", "parentId": "10436.81", "relation": -1, "votes": null, "text": "Often people don't. If people did then Glassdoor would be more famous."}, "10436.104": {"id": "10436.104", "parentId": "10436.81", "relation": -1, "votes": null, "text": "Since salaries are not public, Glassdoor has limited information about the salaries of people. Therefore, their figures are unlikely to be accurate."}, "10436.106": {"id": "10436.106", "parentId": "10436.19", "relation": -1, "votes": null, "text": "Two wrongs don't make a right. The existence of unjustified hierarchies does not warrant the creation of more unjustified ones."}, "10436.108": {"id": "10436.108", "parentId": "10436.100", "relation": -1, "votes": null, "text": "People care what other people think of them. If favoritism would be transparent they'll also have this to consider when they consider indulging it."}, "10436.112": {"id": "10436.112", "parentId": "10436.110", "relation": 1, "votes": null, "text": "Your boss may think you're incapable of improving."}, "10436.114": {"id": "10436.114", "parentId": "10436.110", "relation": 1, "votes": null, "text": "Your boss may not care if you don't improve."}, "10436.116": {"id": "10436.116", "parentId": "10436.112", "relation": 1, "votes": null, "text": "It's easy for some narrow minded managers to pigeonhole people and having done so never consider that the person could have skills outside their current role."}, "10436.118": {"id": "10436.118", "parentId": "10436.110", "relation": 1, "votes": null, "text": "Your boss may not want you to improve, either feeling personally threatened by your potential or afraid of losing your contribution in your current role."}, "10436.120": {"id": "10436.120", "parentId": "10436.1", "relation": 1, "votes": null, "text": "Once you know your coworker is paid more than you you'll be in a position to ask why and thus perhaps learn of your failings or how you could improve.", "score": -1, "volume": -1}, "10436.110": {"id": "10436.110", "parentId": "10436.120", "relation": 1, "votes": null, "text": "Your boss won't always tell you your failings or how you could improve unless you ask."}, "10436.125": {"id": "10436.125", "parentId": "10436.1", "relation": -1, "votes": null, "text": "Larger companies could crush smaller competitors by raising the salaries of their employees to levels far above what those competitors could pay.", "score": -1, "volume": -1}, "10436.127": {"id": "10436.127", "parentId": "10436.125", "relation": 1, "votes": null, "text": "Rising salaries in one company could cause resentment, possibly even strikes, by employees of competing companies."}, "10436.129": {"id": "10436.129", "parentId": "10436.13", "relation": 1, "votes": null, "text": "Women of colour tend to earn [significantly less](https://time.com/5353848/salary-pay-transparency-work/) than white women. If they were aware of how much everyone else was being paid, they might feel more empowered to demand equal pay from their boss."}, "10436.131": {"id": "10436.131", "parentId": "10436.1", "relation": 1, "votes": null, "text": "Publishing salaries might help business attract the very best talent and thus help the business grow.", "score": -1, "volume": -1}, "10436.133": {"id": "10436.133", "parentId": "10436.120", "relation": 1, "votes": null, "text": "You would also be in a better place to know who are the best employees to learn from and [ask for help](https://time.com/5353848/salary-pay-transparency-work/) so you can improve."}, "10436.135": {"id": "10436.135", "parentId": "10436.6", "relation": 1, "votes": null, "text": "Studies [suggest](https://time.com/5353848/salary-pay-transparency-work/) that people automatically assume they are underpaid in relation to their co-workers. However, if they were able to compare salaries, they might realise that they are being paid well and be more satisfied"}, "10436.137": {"id": "10436.137", "parentId": "10436.13", "relation": -1, "votes": null, "text": "Transparency with salaries doesn't automatically lead to pay equality."}, "10436.139": {"id": "10436.139", "parentId": "10436.137", "relation": 1, "votes": null, "text": "In US government agencies, which are required to make salaries public, women still only make [81% of what men make](https://time.com/5353848/salary-pay-transparency-work/)."}, "10436.143": {"id": "10436.143", "parentId": "10436.131", "relation": 1, "votes": null, "text": "Being aware of what the average wage for a specific job is might help companies to accurately set remuneration packages in order to attract the most talented workers to their companies."}, "10436.145": {"id": "10436.145", "parentId": "10436.139", "relation": -1, "votes": null, "text": "The same [report](https://time.com/5353848/salary-pay-transparency-work/), in the next sentence, states \"In the private sector, where the majority of companies don’t have pay transparency policies, women earn 79% of what their male counterparts make.\" So that's a 2% improvement that could be attributable to transparency."}, "10436.151": {"id": "10436.151", "parentId": "10436.71", "relation": -1, "votes": null, "text": "There is [already pressure on employers](https://www.theguardian.com/world/2019/jan/01/gender-pay-gap-2018-brought-transparency-will-2019-bring-change) to pay men and women equally."}, "10436.155": {"id": "10436.155", "parentId": "10436.125", "relation": -1, "votes": null, "text": "Prospective employees look for [things beyond financial compensation](https://blog.totaljobs.com/10-things-employees-want) in an employer. Smaller companies could thus leverage other things to remain an attractive prospect."}, "10436.165": {"id": "10436.165", "parentId": "10436.13", "relation": 1, "votes": null, "text": "According to studies, [transparency laws](https://www.nber.org/system/files/working_papers/w25834/w25834.pdf) do significantly reduce the male-female salary gap. \\(\"We find that, on average, transparency laws significantly reduced the male-female salary gap…\" on page 4 of the linked document\\)"}, "10436.167": {"id": "10436.167", "parentId": "10436.133", "relation": -1, "votes": null, "text": "Normally, a salary is based on the experience of the person, their qualifications and their capability to accomplish their tasks. It can also be based on bias, or the mood of the person who set their salary at the time or how much need and urgency there was to fill their role at the time they were employed. Thus the knowledge of how to do their job well is not a large factor in their having a high salary, and even if they have the knowledge they may not be able or willing to articulate it."}}