{"16931.0": {"id": "16931.0", "parentId": null, "relation": null, "votes": null, "text": ""}, "16931.1": {"id": "16931.1", "parentId": "16931.0", "relation": 0, "votes": [2, 0, 0, 0, 4], "text": "Businesses should be allowed to deny service to anyone."}, "16931.6": {"id": "16931.6", "parentId": "16931.1", "relation": -1, "votes": [3, 1, 0, 0, 3], "text": "Allowing businesses to deny services to anyone may encourage an increase in minority discrimination.", "score": 1.8571428571428572, "volume": 7}, "16931.12": {"id": "16931.12", "parentId": "16931.4", "relation": -1, "votes": [0, 1, 0, 0, 1], "text": "If a religious person does not want to follow non-discrimination laws they have the option of not being in business."}, "16931.15": {"id": "16931.15", "parentId": "16931.12", "relation": -1, "votes": [0, 0, 0, 1, 0], "text": "A person who believes an act to be wrong, must not be forced decide between participating in that act, or giving up their business. Then it's possible that the only business owners would be secular moral relativists."}, "16931.16": {"id": "16931.16", "parentId": "16931.11", "relation": -1, "votes": null, "text": "When morals are overridden by profit, the social contract loses meaning and that's a form of anarchy."}, "16931.18": {"id": "16931.18", "parentId": "16931.11", "relation": -1, "votes": null, "text": "If going out of business is a consideration it is an economic choice not to serve someone. Denying services on other grounds are untouched of this."}, "16931.21": {"id": "16931.21", "parentId": "16931.8", "relation": -1, "votes": null, "text": "There has to be a balance between the private business owner's rights and the civil rights of individuals the business serves."}, "16931.22": {"id": "16931.22", "parentId": "16931.1", "relation": 1, "votes": [0, 0, 1, 0, 1], "text": "It is the right of the business owner to deny service to their customers.", "score": 3.0, "volume": 2}, "16931.24": {"id": "16931.24", "parentId": "16931.2", "relation": -1, "votes": null, "text": "In certain situations, denying service can cause harm to the customer. Ownership does not imply authority to cause harm. No one would agree with the statement \"A gun owner, especially a small gun owner, should have the right to shoot anyone because they own the gun.\""}, "16931.25": {"id": "16931.25", "parentId": "16931.16", "relation": -1, "votes": null, "text": "We can still have a libertarian social contract-based government system while acknowledging individual and business rights to choose who they work with. The government provides protection to its people from foreign and domestic threats, so this is not anarchy."}, "16931.26": {"id": "16931.26", "parentId": "16931.17", "relation": -1, "votes": [1, 0, 0, 0, 1], "text": "Discrimination is not always morally wrong."}, "16931.27": {"id": "16931.27", "parentId": "16931.26", "relation": 1, "votes": [0, 0, 0, 0, 1], "text": "A basketball coach has the right to discriminate against players who are short when he's looking for a center on his team."}, "16931.28": {"id": "16931.28", "parentId": "16931.26", "relation": 1, "votes": [1, 0, 0, 0, 1], "text": "Uber and Lyft have the right to discriminate when hiring against drivers under the age of 21."}, "16931.29": {"id": "16931.29", "parentId": "16931.26", "relation": 1, "votes": [0, 0, 0, 0, 1], "text": "When hiring to fill a violin vacancy, for example, an orchestra has a right to discriminate against people who aren't good at playing the violin."}, "16931.30": {"id": "16931.30", "parentId": "16931.7", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "In the United States, the Federal Civil Rights Act of 1964 is the active law regarding discrimination by private businesses."}, "16931.31": {"id": "16931.31", "parentId": "16931.7", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "This discussion is a prescriptive discussion, not a descriptive discussion. It's about what businesses should be able to do, not just what businesses are able to do."}, "16931.32": {"id": "16931.32", "parentId": "16931.22", "relation": -1, "votes": [0, 0, 0, 0, 0], "text": "Business investors and operators have the option of going out of business, switching to a different business sector, or operating in a different jurisdiction to avoid laws they don't like. Slaves never have any of those options. That's the big difference between anti-discrimination laws and slavery."}, "16931.33": {"id": "16931.33", "parentId": "16931.22", "relation": -1, "votes": [0, 1, 0, 0, 0], "text": "A good government does not simply allow its people to be wrong. All good governments have laws against murder, and all good governments have laws against refusing service to patrons on account of their race."}, "16931.34": {"id": "16931.34", "parentId": "16931.20", "relation": -1, "votes": [0, 0, 0, 1, 0], "text": "The Supreme Court in Masterpiece Cakeshop v. Colorado Civil Rights Commission acknowledges that there is a difference between making something for someone and selling something that you've already made. We can allow businesses to choose not to make something custom for someone while still not allowing businesses to deny service to anyone on products that they have on their menus with no modifications needed."}, "16931.36": {"id": "16931.36", "parentId": "16931.1", "relation": -1, "votes": [4, 0, 0, 1, 0], "text": "Denying costs a business valuable customers and sales.", "score": 0.6000000000000001, "volume": 5}, "16931.37": {"id": "16931.37", "parentId": "16931.17", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "Discrimination is a discernment tool, and thus itself is not morally wrong."}, "16931.38": {"id": "16931.38", "parentId": "16931.44", "relation": 1, "votes": null, "text": "This is especially evident in small communities there are a limited number of providers of various services. A persecuted group in such communities would feel the impact of denial of service very strongly."}, "16931.39": {"id": "16931.39", "parentId": "16931.23", "relation": -1, "votes": null, "text": "It's not the same. Not all gays are black, and not all blacks are gays."}, "16931.19": {"id": "16931.19", "parentId": "16931.17", "relation": 1, "votes": null, "text": "Businesses that are subsidized by the government, or otherwise delivering a public service on behalf or in cooperation with government, should be required to conform with government anti-discrimination standards."}, "16931.44": {"id": "16931.44", "parentId": "16931.1", "relation": -1, "votes": null, "text": "Denying customers is a disservice to the community.", "score": -1, "volume": -1}, "16931.10": {"id": "16931.10", "parentId": "16931.44", "relation": 1, "votes": null, "text": "Most businesses are serving the local or national community by providing items or services. The government usually supports them with decreased taxes, fair market rules and let's not forget the whole infrastructure of a country. By denying service without a good reason, they break their side of the contract with the government, because they refused to serve the community."}, "16931.47": {"id": "16931.47", "parentId": "16931.1", "relation": 1, "votes": [1, 0, 1, 1, 4], "text": "Denying service allows people of various religions the right to exercise their beliefs.", "score": 3.0, "volume": 7}, "16931.4": {"id": "16931.4", "parentId": "16931.47", "relation": 1, "votes": [0, 0, 1, 0, 1], "text": "Not having the freedom to do so could discourage a religious person from owning their own company."}, "16931.50": {"id": "16931.50", "parentId": "16931.17", "relation": -1, "votes": null, "text": "Discrimination is a tool we use to suppress bad behavior or support good behavior and is needed to build and hold stable societies \\(example: discrimination against violence by incarceration\\)"}, "16931.8": {"id": "16931.8", "parentId": "16931.7", "relation": 1, "votes": null, "text": "Customers can exercise their right where to patronize."}, "16931.53": {"id": "16931.53", "parentId": "16931.22", "relation": 1, "votes": [0, 0, 0, 0, 1], "text": "Refusing service is itself a form of free speech."}, "16931.57": {"id": "16931.57", "parentId": "16931.38", "relation": 1, "votes": null, "text": "Many business have monopolies over major utilities e.g. water, electricity, heating."}, "16931.58": {"id": "16931.58", "parentId": "16931.2", "relation": 1, "votes": [0, 0, 0, 0, 1], "text": "Like a home, if you own or rent a property your tenant rights can be invoked to deign entry and removal of anyone for any reason as you see fit."}, "16931.59": {"id": "16931.59", "parentId": "16931.2", "relation": -1, "votes": [1, 1, 0, 0, 0], "text": "This becomes complicated when multiple owners and staff are involved, forcing staff to refuse service based on political, cultural or racial grounds is unacceptable, even if they agree to do it."}, "16931.60": {"id": "16931.60", "parentId": "16931.22", "relation": 1, "votes": [0, 0, 0, 0, 2], "text": "Making it customary for employees to also deny customers when is it against their will is wrong. It violates their right to free will."}, "16931.7": {"id": "16931.7", "parentId": "16931.22", "relation": 1, "votes": [1, 0, 0, 0, 0], "text": "It is not a law to give service to everyone."}, "16931.13": {"id": "16931.13", "parentId": "16931.36", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "If the possibility of being sued or fined is off the table, naturally occurring capitalism will either support the business decision, or the business will suffer based on their refusal to serve. It's a risk the owner should be free to take"}, "16931.20": {"id": "16931.20", "parentId": "16931.9", "relation": -1, "votes": null, "text": "If the person doesn't want to make something for someone, they know that they'll be losing out on some money but that's their business, not yours. You can't infringe on someone's business just because you get mad over them not making something you want. Go to another place where they will and they'll be glad to take your money."}, "16931.9": {"id": "16931.9", "parentId": "16931.17", "relation": 1, "votes": null, "text": "Nobody would want a possibility that they could be denied service."}, "16931.17": {"id": "16931.17", "parentId": "16931.6", "relation": 1, "votes": [1, 1, 0, 1, 0], "text": "Denying service to some category of people is discrimination, which is morally wrong."}, "16931.3": {"id": "16931.3", "parentId": "16931.6", "relation": 1, "votes": [0, 1, 0, 0, 0], "text": "Businesses should give service to everyone, regardless of their personal beliefs."}, "16931.74": {"id": "16931.74", "parentId": "16931.60", "relation": 1, "votes": null, "text": "Forcing employees to uphold a company policy that violates civil-rights isn't viable, even if they agree to uphold it as terms of employment because it will then start a basis for hiring and firing people on the grounds of their willingness to be \\(for example\\) racist or homophobic."}, "16931.75": {"id": "16931.75", "parentId": "16931.53", "relation": -1, "votes": null, "text": "The owner themselves personally refusing service maybe, forcing employees to refuse service however is dubious at best."}, "16931.77": {"id": "16931.77", "parentId": "16931.13", "relation": 1, "votes": null, "text": "Refusal of service for any or no reason would mean there's no evidence it is race based."}, "16931.78": {"id": "16931.78", "parentId": "16931.13", "relation": -1, "votes": null, "text": "If the community the business operates within is predominantly racist said business would do fine, even potentially forcing people not of that race to travel to other communities for daily needs or even leave said community."}, "16931.79": {"id": "16931.79", "parentId": "16931.33", "relation": -1, "votes": null, "text": "A good government keeps the peace, not corrects its citizens."}, "16931.80": {"id": "16931.80", "parentId": "16931.32", "relation": -1, "votes": null, "text": "Slavery is rejecting civil liberty, historically by rejecting citizenship status, the abolition of slavery was more about recognising slaves as citizens, therefore entitled to the same civil liberties as any other citizen."}, "16931.81": {"id": "16931.81", "parentId": "16931.32", "relation": 1, "votes": null, "text": "Businesses have the option to appeal to a select market."}, "16931.82": {"id": "16931.82", "parentId": "16931.32", "relation": -1, "votes": null, "text": "The civil-rights movement differs from the abolition of slavery in that while abolition was classifying slaves as citizens status, civil-rights is classifying citizens as equal in status."}, "16931.85": {"id": "16931.85", "parentId": "16931.24", "relation": -1, "votes": [0, 0, 0, 0, 1], "text": "That sounds good but would have to be an unfair comparison, guns are designed to kill, no two ways about it, business isn't designed to kill, it's to provide a legally acceptable service."}, "16931.88": {"id": "16931.88", "parentId": "16931.1", "relation": -1, "votes": [1, 0, 1, 1, 2], "text": "If every business denied service to the same group, it would be difficult for these people to get their essential goods, such as groceries.", "score": 2.6, "volume": 5}, "16931.89": {"id": "16931.89", "parentId": "16931.7", "relation": -1, "votes": null, "text": "It is not Law's responsibility to legislate on other's property. \\(e.g. a business\\)"}, "16931.90": {"id": "16931.90", "parentId": "16931.33", "relation": -1, "votes": null, "text": "The government's responsibility is to ensure its people can exercise their freedom, not to dictate how they should exercise it."}, "16931.91": {"id": "16931.91", "parentId": "16931.75", "relation": -1, "votes": null, "text": "An employee is not forced to do anything. They sign a mutual agreement on service when they are employed and are free to quite at any time."}, "16931.92": {"id": "16931.92", "parentId": "16931.14", "relation": -1, "votes": null, "text": "Businesses usually have a permit from the government to operate. That permit represents a kind of contract."}, "16931.94": {"id": "16931.94", "parentId": "16931.2", "relation": 1, "votes": null, "text": "[Free markets](https://en.wikipedia.org/wiki/Free_market#General_principles) *should* close any business which unduly discriminates."}, "16931.99": {"id": "16931.99", "parentId": "16931.47", "relation": -1, "votes": null, "text": "In a society of multiple religions, where beliefs are based on collective and individual interpretation, this would lead to widespread discrimination without concrete reasoning."}, "16931.100": {"id": "16931.100", "parentId": "16931.28", "relation": -1, "votes": null, "text": "Discriminating against young people of a certain age due to problems concerning their sense of responsibility and motor adeptness, concerns which are supported by the limited development of youth brains below the age of 25, is culturally and scientifically appropriate. Discriminating against people for factors such as culture or appearance is neither culturally accepted or scientifically accurate."}, "16931.101": {"id": "16931.101", "parentId": "16931.78", "relation": -1, "votes": null, "text": "A predominantly racist community would force people not of that race to leave said community even if the businesses don't discriminate on their service provision."}, "16931.103": {"id": "16931.103", "parentId": "16931.88", "relation": -1, "votes": null, "text": "This group could potentially create a business to provide said service to this group only, e.g. vegans creating vegan restaurants."}, "16931.104": {"id": "16931.104", "parentId": "16931.1", "relation": 1, "votes": null, "text": "Without the right to deny services to anyone, a business couldn't exercise boycott to undesirable groups.", "score": -1, "volume": -1}, "16931.105": {"id": "16931.105", "parentId": "16931.59", "relation": -1, "votes": null, "text": "If they agreed, they accepted, so it is totally acceptable. It's not up to third-parties to accept or unaccept a free agreement"}, "16931.107": {"id": "16931.107", "parentId": "16931.10", "relation": -1, "votes": null, "text": "Business pay for commercial infrastructure by way of taxes, not serving their community."}, "16931.108": {"id": "16931.108", "parentId": "16931.26", "relation": 1, "votes": null, "text": "Refusing service to a group of people who do not have money to pay for the service is a good business decision, and almost universally considered moral."}, "16931.109": {"id": "16931.109", "parentId": "16931.9", "relation": -1, "votes": null, "text": "It is entirely possible that a rational individual would want to be denied service."}, "16931.110": {"id": "16931.110", "parentId": "16931.109", "relation": 1, "votes": null, "text": "A business might hold political or social beliefs that a consumer strongly disagrees with, and would not have wanted service had they known of the beliefs previously."}, "16931.111": {"id": "16931.111", "parentId": "16931.109", "relation": 1, "votes": null, "text": "A service provider with too many customers may refuse service to an individual who, if given the option, would rather take no service than sub-par or rushed service."}, "16931.112": {"id": "16931.112", "parentId": "16931.19", "relation": 1, "votes": null, "text": "Government is not the arbiter of morality. Its possible for a government's anti-discrimination standards to allow businesses to refuse service to anyone for any reason, or no reason at all."}, "16931.113": {"id": "16931.113", "parentId": "16931.99", "relation": -1, "votes": null, "text": "Reason is as much of a worldview as any other religion. Viewing reason as the arbiter of morality requires the same circular justification as viewing religion as givers of right and wrong."}, "16931.114": {"id": "16931.114", "parentId": "16931.99", "relation": -1, "votes": null, "text": "Widespread discrimination is not a guaranteed outcome of collective and individual interpretation of religion."}, "16931.115": {"id": "16931.115", "parentId": "16931.93", "relation": 1, "votes": null, "text": "Nobody has a right to another person's time and effort. What they chose to do with it, and for whom, is entirely up to them."}, "16931.116": {"id": "16931.116", "parentId": "16931.93", "relation": 1, "votes": null, "text": "Many businesses are run in a privately-owned space. Proprietor should have the right to deny access and service to anyone within that space, whether it be physical or digital."}, "16931.117": {"id": "16931.117", "parentId": "16931.103", "relation": -1, "votes": null, "text": "It is also possible that the same group of people could be denied supply at every level of the supply line. In this case, the group would be entirely denied of said goods, and have no option of ever acquiring the good."}, "16931.118": {"id": "16931.118", "parentId": "16931.114", "relation": 1, "votes": null, "text": "Many religions, both Western and Eastern, have underlying principles of [doing good to those around you](http://yhteisymmarrysviikko.fi/media/Golden-rule-across-the-worlds-religions.pdf). Individual \\(mis\\)interpretation of the religion may lead to discrimination, but it would not be widespread, as the core tenants of the religion would remain the same."}, "16931.121": {"id": "16931.121", "parentId": "16931.104", "relation": 1, "votes": null, "text": "A feminist store, for example, couldn't boycott toxic male individuals, and a store for people of colour couldn't deny services to a white supremacist."}, "16931.123": {"id": "16931.123", "parentId": "16931.1", "relation": 1, "votes": null, "text": "Collective \\(i.e. governmental\\) compulsion of service is immoral.", "score": -1, "volume": -1}, "16931.125": {"id": "16931.125", "parentId": "16931.123", "relation": 1, "votes": null, "text": "There are no things which are immoral for individuals, but which are moral for a collective of individuals."}, "16931.102": {"id": "16931.102", "parentId": "16931.22", "relation": 1, "votes": null, "text": "Without being able to discriminate to whom the service will be provided, the concept of ownership, e.g. owner of a business, becomes nonsense."}, "16931.131": {"id": "16931.131", "parentId": "16931.44", "relation": 1, "votes": null, "text": "The economy is stronger and more efficient when businesses don't discriminate against potential clients for reasons other than the financial costs and benefits."}, "16931.132": {"id": "16931.132", "parentId": "16931.115", "relation": -1, "votes": null, "text": "The state often rightfully coerces individuals to perform [non-voluntary](https://en.wikipedia.org/wiki/Conscription) [transactions](https://en.wikipedia.org/wiki/Tax)."}, "16931.228": {"id": "16931.228", "parentId": "16931.6", "relation": -1, "votes": null, "text": "There are consequences to discriminating in this way, which will likely negatively impact the business."}, "16931.234": {"id": "16931.234", "parentId": "16931.1", "relation": 1, "votes": null, "text": "Businesses can prohibit the misuse of product or service by prohibiting or restricting access.", "score": -1, "volume": -1}, "16931.230": {"id": "16931.230", "parentId": "16931.6", "relation": -1, "votes": null, "text": "Businesses can disclose the reasons for denying service."}, "16931.2": {"id": "16931.2", "parentId": "16931.22", "relation": 1, "votes": null, "text": "A business, especially a small business, should have the right to deny service to anyone because they own the business."}, "16931.93": {"id": "16931.93", "parentId": "16931.22", "relation": 1, "votes": null, "text": "Any business transaction ought to be mutually voluntary. If the government is forcing either party to the table, that is violating said parties freedom."}}